app/controllers/api/v1/teachers_controller.rb

SELECT "teachers".* FROM "teachers"
---
    def index
        teachers = Teacher.all

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        teacher = Teacher.find(params[:id])

INSERT INTO "teachers" ("name", "email", "birth", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "adriano"], ["email", "adriano@mail.com"], ["birth", "1999-02-02"], ["created_at", "2021-10-04 06:06:22.836392"], ["updated_at", "2021-10-04 06:06:22.836392"]]
---
    def create
        teacher = Teacher.new(teacher_params)
        teacher.save!

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "teachers" SET "name" = $1, "updated_at" = $2 WHERE "teachers"."id" = $3  [["name", "adriano campos"], ["updated_at", "2021-10-04 06:37:48.511999"], ["id", 3]]
---
    def update
        teacher = Teacher.find(params[:id])
        teacher.update!(teacher_params)

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "teachers" WHERE "teachers"."id" = $1  [["id", 3]]
---
    def delete
        teacher = Teacher.find(params[:id])
        teacher.destroy!

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def my_students
        teacher = Teacher.find(params[:id])